-- MySQL dump 10.13  Distrib 8.0.25, for macos10.15 (x86_64)
--
-- Host: localhost    Database: book_keeping
-- ------------------------------------------------------
-- Server version	8.0.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `invest`
--

DROP TABLE IF EXISTS `invest`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `invest` (
  `vest_id` int NOT NULL AUTO_INCREMENT COMMENT '投资ID',
  `prd_channel` char(20) DEFAULT NULL COMMENT '产品购买渠道',
  `prd_name` char(80) DEFAULT NULL COMMENT '产品名称',
  `prd_rate` float(10,2) DEFAULT NULL COMMENT '产品预期收益',
  `prd_status` char(1) DEFAULT NULL COMMENT '产品状态（未赎回N,已赎回Y）',
  `buy_amt` float(10,2) DEFAULT NULL COMMENT '购买金额',
  `buy_date` date DEFAULT NULL COMMENT '购买日',
  `ma_date` date DEFAULT NULL COMMENT '到期日',
  `ac_date` date DEFAULT NULL COMMENT '会计日',
  `current_amt` float(10,2) DEFAULT NULL COMMENT '记账日总金额',
  `profit` float(10,2) DEFAULT NULL COMMENT '当前收益金额',
  `days` int DEFAULT NULL COMMENT '相差天数',
  `real_rate` float DEFAULT NULL COMMENT '真实年化',
  `isnew` char(1) DEFAULT NULL COMMENT '是否最新记录（Y,N）',
  `ts` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '时间戳',
  PRIMARY KEY (`vest_id`)
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8mb3 COMMENT='投资信息表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `invest`
--

LOCK TABLES `invest` WRITE;
/*!40000 ALTER TABLE `invest` DISABLE KEYS */;
INSERT INTO `invest` VALUES (1,'网商银行','信银理财安盈象固收稳利三个月持有期29号理财产品',NULL,'N',30000.00,'2025-04-22','2025-07-22','2025-05-08',30032.40,32.40,16,2.46,'N','2025-05-21 13:39:51'),(2,'网商银行','信银理财安盈象固收稳利三个月持有期29号理财产品',NULL,'N',30000.00,'2025-04-22','2025-07-22','2025-05-17',30053.01,53.01,25,2.58,'N','2025-05-21 13:39:51'),(3,'网商银行','交银理财稳享固收精选日开25号（90天持有期）理财产品B',NULL,'N',20000.00,'2025-04-16','2025-07-16','2025-05-08',20019.14,19.14,22,1.59,'N','2025-05-17 08:19:21'),(4,'网商银行','信银理财安盈象固收稳健六个月持有期42号理财产品',NULL,'N',10000.00,'2025-04-16','2025-10-15','2025-05-08',10007.87,7.87,22,1.31,'N','2025-05-17 08:20:09'),(5,'网商银行','建信理财惠众（日申月赎）固收类产品（中旬）第1期',NULL,'N',10000.00,'2025-04-16','2025-05-14','2025-05-08',10016.32,16.32,22,2.71,'N','2025-05-17 08:20:22'),(6,'网商银行','交银理财稳享固收精选日开25号（90天持有期）理财产品B',NULL,'N',20000.00,'2025-04-16','2025-07-16','2025-05-17',20036.38,36.38,31,2.14,'N','2025-05-20 15:36:30'),(7,'网商银行','信银理财安盈象固收稳健六个月持有期42号理财产品',NULL,'N',10000.00,'2025-04-16','2025-10-15','2025-05-17',10012.79,12.79,31,1.51,'N','2025-05-20 15:38:59'),(8,'网商银行','建信理财惠众（日申月赎）固收类产品（中旬）第1期',NULL,'N',10000.00,'2025-04-16','2025-05-14','2025-05-17',10023.50,23.50,31,2.77,'N','2025-05-20 15:39:50'),(9,'网商银行','平安理财新卓越指数增强日开180天持有1号固收类理财产品A',NULL,'N',20000.00,'2025-04-22','2025-10-20','2025-05-08',20013.80,13.80,16,1.57,'N','2025-05-17 08:22:06'),(10,'网商银行','平安理财新卓越指数增强日开180天持有1号固收类理财产品A',NULL,'N',20000.00,'2025-04-22','2025-10-20','2025-05-17',20029.57,29.57,25,2.16,'N','2025-05-20 15:39:24'),(11,'网商银行','信银理财安盈象固收稳利三个月持有期29号理财产品',NULL,'N',30000.00,'2025-04-22','2025-07-22','2025-05-20',30055.00,55.00,28,2.39,'N','2025-05-21 13:40:16'),(12,'网商银行','交银理财稳享固收精选日开25号（90天持有期）理财产品B',NULL,'N',20000.00,'2025-04-16','2025-07-16','2025-05-20',20038.30,38.30,34,2.06,'N','2025-05-21 13:40:46'),(13,'网商银行','信银理财安盈象固收稳健六个月持有期42号理财产品',NULL,'N',10000.00,'2025-04-16','2025-10-15','2025-05-20',10013.78,13.78,34,1.48,'N','2025-05-21 13:41:05'),(14,'网商银行','平安理财新卓越指数增强日开180天持有1号固收类理财产品A',NULL,'N',20000.00,'2025-04-22','2025-10-20','2025-05-20',20025.63,25.63,28,1.67,'N','2025-05-21 13:42:00'),(15,'网商银行','建信理财惠众（日申月赎）固收类产品（中旬）第1期',NULL,'N',10000.00,'2025-04-16','2025-05-14','2025-05-20',10024.12,24.12,34,2.59,'N','2025-05-21 13:41:24'),(16,'网商银行','信银理财安盈象固收稳利三个月持有期29号理财产品',NULL,'N',30000.00,'2025-04-22','2025-07-22','2025-05-21',30055.96,55.96,29,2.35,'Y','2025-05-21 13:40:16'),(17,'网商银行','交银理财稳享固收精选日开25号（90天持有期）理财产品B',NULL,'N',20000.00,'2025-04-16','2025-07-16','2025-05-21',20040.22,40.22,35,2.1,'Y','2025-05-21 13:40:46'),(18,'网商银行','信银理财安盈象固收稳健六个月持有期42号理财产品',NULL,'N',10000.00,'2025-04-16','2025-10-15','2025-05-21',10014.76,14.76,35,1.54,'Y','2025-05-21 13:41:05'),(19,'网商银行','建信理财惠众（日申月赎）固收类产品（中旬）第1期',NULL,'N',10000.00,'2025-04-16','2025-05-14','2025-05-21',10026.08,26.08,35,2.72,'Y','2025-05-21 13:41:24'),(20,'网商银行','平安理财新卓越指数增强日开180天持有1号固收类理财产品A',NULL,'N',20000.00,'2025-04-22','2025-10-20','2025-05-21',20031.55,31.55,29,1.99,'Y','2025-05-21 13:42:00'),(21,'中国银行','信银理财-安盈象固收稳利三个月持有期29号G',NULL,'N',14000.00,'2025-04-29','2025-07-28','2025-05-21',14021.96,21.96,22,2.6,'Y','2025-05-21 13:49:11'),(22,'渤海银行','理财有术丰裕持盈180天最短持有期固收增强1号',NULL,'N',10000.00,'2025-02-25','2025-08-25','2025-05-21',10047.22,47.22,85,2.03,'Y','2025-05-21 14:00:37'),(23,'渤海银行','理财有术丰裕持盈180天最短持有期固收增强1号',NULL,'N',10000.00,'2025-02-25','2025-08-25','2025-05-08',10033.89,33.89,72,1.72,'N','2025-05-21 14:01:47'),(24,'中国银行','信银理财-安盈象固收稳利三个月持有期29号G',NULL,'N',14000.00,'2025-04-29','2025-07-28','2025-05-08',14009.61,9.61,9,2.78,'N','2025-05-21 14:02:48'),(25,'渤海银行','添金宝',NULL,'N',15954.03,'2025-05-21','2025-05-21','2025-05-21',15954.03,0.00,0,0,'Y','2025-05-21 14:11:08');
/*!40000 ALTER TABLE `invest` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-21 22:16:03
